/**
 * Socket协议事件
 * @author lucywang
 * @date 2017/10/19
 */
module JAY {
    export enum SocketEvents {

        /**
         * Game
         */
         Send100000 = 100000,             //发送心跳
         Send100002 = 100002,             //发送登录    
         Send100010 = 100010,             //发送断线重连     
         Send100100 = 100100,             //发送玩家准备，取消准备   
         Send100101 = 100101,             //发送创建好友桌     
         Send100102 = 100102,             //发送加入好友桌     
         Send100103 = 100103,             //发送玩家退出桌子    
         Send100104 = 100104,             //发送加入匹配桌
         Send100105 = 100105,             //发送选择房间


         Send100110 = 100110,             //发送解散桌子     
         Send100111 = 100111,             //发送解散桌子应答     
         Send100120 = 100120,             //发送自定义配置     
         Send100130 = 100130,             //发送玩家断线    
         Send100140 = 100140,             //发送玩家叫牌    

         Send100999 = 100999,             //发送测试接口消息 

         Rev100000 = 100000,             //接收心跳
        //  Rev100002 = 100002,             //接收登录    
         Rev100010 = 100010,             //接收断线重连     
        //  Rev100100 = 100100,             //接收玩家准备，取消准备   
        //  Rev100101 = 100101,             //接收创建好友桌     
        //  Rev100102 = 100102,             //接收加入好友桌     
         Rev100103 = 100103,             //接收玩家退出桌子    
         Rev100104 = 100104,             //接收加入匹配桌

         Rev100110 = 100110,             //接收解散桌子     
         Rev100111 = 100111,             //接收解散桌子应答     
         Rev100120 = 100120,             //接收自定义配置     
         Rev100130 = 100130,             //接收玩家断线    
        //  Rev100140 = 100140,             //接收玩家叫牌    

        //  Rev100999 = 100999,             //接收测试接口消息 

         Rev101001 = 101001,             //推送其他玩家叫牌 
         Rev101002 = 101002,             //推送玩家摸牌
         Rev101003 = 101003,             //推送游戏结束
         Rev101004 = 101004,             //推送定庄信息
         Rev101005 = 101005,             //推送发牌信息
         Rev101006 = 101006,             //推送游戏结算
         Rev101007 = 101007,             //推送游戏补花
         Rev101008 = 101008,             //推送补花
        //  Rev101009 = 101009,             //推送某玩家叫牌的结果

         Rev101100 = 101100,             //推送玩家点数发生变化
         Rev101101 = 101101,             //推送玩家在其他地方登陆
         Rev101102 = 101102,             //推送桌子解散结果
         Rev101103 = 101103,             //推送有玩家请求解散桌子
         Rev101104 = 101104,             //推送玩家对解散桌子的响应
         Rev101105 = 101105,             //推送玩家退出桌子
         Rev101106 = 101106,             //推送玩家准备/取消准备
         Rev101107 = 101107,             //推送玩家加入桌子
         Rev101108 = 101108,             //推送更改了配置
         Rev101109 = 101109,             //推送玩家断线重连
         Rev101110 = 101110,             //推送其他玩家叫牌    
         Rev101112 = 101112,             //推送玩家动作响应     

         Send100112 = 100112,             //测试接口，解放房间
    }
}